In [1]:
import sqlite3

In [2]:
conn = sqlite3.connect('test.db')

In [3]:
# To create a table in sqlit : 
### CREATE TABLE COMPANY2 (ID INT PRIMARY KEY NOT NULL,
                    #  NAME TEXT NOT NULL,
                     # AGE INT NOT NULL,
                      # ADDRESSS CHAR(50),
                      # SALARY REAL);

In [4]:
conn.execute('''CREATE TABLE COMPANY4
            (ID INT PRIMARY KEY NOT NULL,
            NAME TEXT NOT NULL,
            AGE INT NOT NULL,
            ADDRESS CHAR(50),
            SALARY REAL);''') # connecting the table to test db and executing it

In [5]:
conn.close()

In [6]:
conn = sqlite3.connect('test.db')
conn.execute("INSERT INTO COMPANY4 (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES(1, 'Paul', 32, 'California', 20000.00)");
conn.execute("INSERT INTO COMPANY4 (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES(2, 'Allen', 25, 'Texas', 15000.00)");
conn.execute("INSERT INTO COMPANY4 (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES(3, 'Teddy', 23, 'Norway', 20000.00)");
conn.execute("INSERT INTO COMPANY4 (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES(4, 'Mark', 25, 'Rich-Mond', 65000.00)");
conn.commit()

In [7]:
conn.close()

In [8]:
conn = sqlite3.connect('test.db')

In [9]:
crsr = conn.cursor()

In [10]:
crsr.execute('SELECT*FROM COMPANY4');

In [11]:
crsr.fetchall()

[(1, 'Paul', 32, 'California', 20000.0),
 (2, 'Allen', 25, 'Texas', 15000.0),
 (3, 'Teddy', 23, 'Norway', 20000.0),
 (4, 'Mark', 25, 'Rich-Mond', 65000.0)]

[(1, 'Paul', 32, 'California', 20000.0),
 (2, 'Allen', 25, 'Texas', 15000.0),
 (3, 'Teddy', 23, 'Norway', 20000.0),
 (4, 'Mark', 25, 'Rich-Mond', 65000.0)]

In [12]:
conn.close()

In [13]:
conn=sqlite3.connect('test.db')

In [14]:
crsr=conn.cursor()

In [15]:
crsr.execute('SELECT NAME, AGE FROM COMPANY4')

In [16]:
crsr.fetchall()

[('Paul', 32), ('Allen', 25), ('Teddy', 23), ('Mark', 25)]

[('Paul', 32), ('Allen', 25), ('Teddy', 23), ('Mark', 25)]

In [17]:
conn=sqlite3.connect('test.db')
crsr=conn.cursor()

In [50]:
conn.execute('UPDATE COMPANY4 SET AGE=30, ADDRESS="WASHINGTON DC" WHERE ID=1');

In [51]:
conn.commit

In [52]:
conn.close()

In [53]:
conn = sqlite3.connect('test.db')

In [54]:
crsr = conn.cursor()

In [55]:
crsr.execute('SELECT * FROM COMPANY4');

In [56]:
crsr.fetchall() # theres some mistake here please check it later

[(1, 'Paul', 32, 'California', 20000.0),
 (2, 'Allen', 25, 'Texas', 15000.0),
 (3, 'Teddy', 23, 'Norway', 20000.0),
 (4, 'Mark', 25, 'Rich-Mond', 65000.0)]

[(1, 'Paul', 32, 'California', 20000.0),
 (2, 'Allen', 25, 'Texas', 15000.0),
 (3, 'Teddy', 23, 'Norway', 20000.0),
 (4, 'Mark', 25, 'Rich-Mond', 65000.0)]

In [57]:
conn = sqlite3.connect('test.db')
crsr = conn.cursor()

In [58]:
crsr.execute("SELECT NAME, AGE, SALARY FROM COMPANY4 WHERE AGE<28");

In [59]:
crsr.fetchall()

[('Allen', 25, 15000.0), ('Teddy', 23, 20000.0), ('Mark', 25, 65000.0)]

[('Allen', 25, 15000.0), ('Teddy', 23, 20000.0), ('Mark', 25, 65000.0)]

In [60]:
conn.close()

In [61]:
conn = sqlite3.connect('test.db')

In [62]:
conn.execute('DELETE FROM COMPANY4 WHERE NAME="Teddy"');

In [63]:
crsr = conn.cursor()

In [64]:
crsr.execute("SELECT * FROM COMPANY4");

In [65]:
crsr.fetchall()

[(1, 'Paul', 32, 'California', 20000.0),
 (2, 'Allen', 25, 'Texas', 15000.0),
 (4, 'Mark', 25, 'Rich-Mond', 65000.0)]

[(1, 'Paul', 32, 'California', 20000.0),
 (2, 'Allen', 25, 'Texas', 15000.0),
 (4, 'Mark', 25, 'Rich-Mond', 65000.0)]

In [70]:
conn.close()

In [71]:
conn = sqlite3.connect('test.db')

In [73]:
conn.execute('''CREATE TABLE SALES
            (SALESID INT PRIMARY KEY NOT NULL
            ID INT NOT NULL,
            NAME TEXT NOT NULL,
            PRODUCTID INT NOT NULL,
            QUANTITY INT,
            MONTH CHAR(3));''')

OperationalError: near "ID": syntax error

OperationalError: near "ID": syntax error